#include "stm32f10x.h"
#include "user_systick.h"
#include "led.h"

 
/**************************************************************************************
 * 描  述 : 初始化SysTick定时器
 * 入  参 : 无
 * 返回值 : 无
 注：重装值不能大于16777215（24位计数器FFFFFF）	
 **************************************************************************************/
void SysTick_Init(void)
{
	 /* SysTick_Config会选择SysTick定时器时钟是SYSCLK，打开SysTick定时器并开启中断  */
	 SysTick_Config(72000);        //重装值设为71999
	
//	 SysTick_Config(72000/8);        //重装值设为8999
//	 SysTick->CTRL  &= ~SysTick_CTRL_CLKSOURCE_Msk;   //选择SysTick定时器时钟是SYSCLK/8	
}
	
/**************************************************************************************
 * 描  述 : SysTick中断服务函数
 * 入  参 : 无
 * 返回值 : 无
 **************************************************************************************/
